app/controllers/members_controller.rb

    def create
        @house = House.find(params[:house_id])
        @member = Member.new(member_params)
        @member.house = @house

        if @member.save
---
INSERT INTO "members" ("first_name", "last_name", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "John"], ["last_name", "Cena"], ["house_id", 1], ["created_at", "2020-04-16 15:30:04.807501"], ["updated_at", "2020-04-16 15:30:04.807501"]]